FedorChervyakov/ec-pH-thread-coap/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN FREERTOS_WRAPPER_FUNCTIONS */

/* USER CODE END FREERTOS_WRAPPER_FUNCTIONS */

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief This function is used to handle the pH requests
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_ph_ReqHandler(otCoapHeader   * pHeader,
                            otMessage               * pMessage,
                            const otMessageInfo     * pMessageInfo)
{
    do
    {
        APP_DBG(" ********* APP_THREAD_ph_ReqHandler \r\n");
        if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
        {
            if (APP_THREAD_ph_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
        else
        {
          APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE, 0);
          break;
        }
    } 
    while (false);
}

/**
 * @brief This function is used to send the pH response
 *
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static otError APP_THREAD_ph_RespSend(otCoapHeader  * pRequestHeader,
                            const otMessageInfo     * pMessageInfo)
{
    otError error = OT_ERROR_NONE;

    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));
        otCoapHeaderAppendContentFormatOption(&OT_Header,
                            OT_COAP_OPTION_CONTENT_FORMAT_TEXT_PLAIN);
        otCoapHeaderSetPayloadMarker(&OT_Header);

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }

        error = otMessageAppend(pOT_Message, (void *) PH_str, sizeof(*PH_str)*strlen(PH_str));
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
            break;
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;
}

/* EC resource request handler */ 
static void APP_THREAD_ec_ReqHandler(otCoapHeader   * pHeader,
                            otMessage               * pMessage,
                            const otMessageInfo     * pMessageInfo)
{
    do
    {
        APP_DBG(" ********* APP_THREAD_ec_ReqHandler \r\n");
        if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
        {
            if (APP_THREAD_ec_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
        else
        {
          APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE, 0);
          break;
        }
    } 
    while (false);
}

static otError APP_THREAD_ec_RespSend(otCoapHeader  * pRequestHeader,
                            const otMessageInfo     * pMessageInfo)
{
    otError error = OT_ERROR_NONE;

    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));
        otCoapHeaderAppendContentFormatOption(&OT_Header,
                            OT_COAP_OPTION_CONTENT_FORMAT_TEXT_PLAIN);
        otCoapHeaderSetPayloadMarker(&OT_Header);

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }

        error = otMessageAppend(pOT_Message, (void *) EC_str, sizeof(*EC_str)*strlen(EC_str));
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
            break;
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;
}

/* Temperature resource request handler */ 
static void APP_THREAD_temp_ReqHandler(otCoapHeader * pHeader,
                            otMessage               * pMessage,
                            const otMessageInfo     * pMessageInfo)
{
    do
    {
        APP_DBG(" ********* APP_THREAD_temp_ReqHandler \r\n");
        if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
        {
            if (APP_THREAD_temp_RespSend(pHeader, pMessageInfo) != OT_ERROR_NONE)
            {
                APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE, 0);
            }
        }
        else
        {
          APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE, 0);
          break;
        }
    } 
    while (false);
}

static otError APP_THREAD_temp_RespSend(otCoapHeader * pRequestHeader,
                            const otMessageInfo      * pMessageInfo)
{
    otError error = OT_ERROR_NONE;

    do
    {
        otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetMessageId(&OT_Header, otCoapHeaderGetMessageId(pRequestHeader));
        otCoapHeaderSetToken(&OT_Header,
                            otCoapHeaderGetToken(pRequestHeader),
                            otCoapHeaderGetTokenLength(pRequestHeader));
        otCoapHeaderAppendContentFormatOption(&OT_Header,
                            OT_COAP_OPTION_CONTENT_FORMAT_TEXT_PLAIN);
        otCoapHeaderSetPayloadMarker(&OT_Header);

        pOT_Message = otCoapNewMessage(NULL, &OT_Header);
        if (pOT_Message == NULL)
        {
            APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
        }

        error = otMessageAppend(pOT_Message, (void *) TEMP_str, sizeof(*TEMP_str)*strlen(TEMP_str));
        if (error != OT_ERROR_NONE)
        {
            APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
            break;
        }

        error = otCoapSendResponse(NULL, pOT_Message, pMessageInfo);
        if (error != OT_ERROR_NONE && pOT_Message != NULL)
        {
            otMessageFree(pOT_Message);
            APP_THREAD_Error(ERR_THREAD_COAP_SEND_RESPONSE,error);
        }


    } while (false);

    return error;

